app/controllers/api/v1/nuggets_controller.rb

    def index
      @nuggets = Nugget.all
---
SELECT "user_nuggets".* FROM "user_nuggets" WHERE "user_nuggets"."nugget_id" = $1  [["nugget_id", 1]]

    def show
      @nugget = Nugget.find(params[:id])
---
SELECT  "nuggets".* FROM "nuggets" WHERE "nuggets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
      @tag = Nugget.find(params[:id])
---
SELECT  "nuggets".* FROM "nuggets" WHERE "nuggets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]