app/controllers/api/v1/themes_controller.rb

    def index
      @themes = Theme.all
---
SELECT "themes".* FROM "themes"

    def find_theme
      @theme = Theme.find(params[:id])
---
SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]