app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "firstname", "lastname", "email") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @user = User.new(user_params)
      if @user.valid? && @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", nil], ["updated_at", "2019-02-23 23:46:01.559557"], ["id", 3]]
---
    def update
      @user = User.find(params[:id])
      if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bobby"], ["LIMIT", 1]]
---
    def signin
      @user = User.find_by(username: params[:username])