app/controllers/api/v1/workspaces_controller.rb

    def index
      @workspaces = Workspace.all
---
SELECT "workspaces".* FROM "workspaces"

    def find_workspace
      @workspace = Workspace.find(params[:id])
---
SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]