app/controllers/application_controller.rb

    def get_current_user
      if decoded_token
        user_id = decoded_token['user_id']
        User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]